{
  "alpha_pattern": {},
  "auto_mapping": null,
  "base_model_name_or_path": "prajjwal1/bert-tiny",
  "beta1": 0.85,
  "beta2": 0.85,
  "bias": "none",
  "corda_config": null,
  "deltaT": 10,
  "eva_config": null,
  "exclude_modules": null,
  "fan_in_fan_out": false,
  "inference_mode": true,
  "init_lora_weights": true,
  "init_r": 12,
  "layer_replication": null,
  "layers_pattern": null,
  "layers_to_transform": null,
  "loftq_config": {},
  "lora_alpha": 32,
  "lora_bias": false,
  "lora_dropout": 0.01,
  "megatron_config": null,
  "megatron_core": "megatron.core",
  "modules_to_save": [
    "qa_outputs"
  ],
  "orth_reg_weight": 0.5,
  "peft_type": "ADALORA",
  "qalora_group_size": 16,
  "r": 8,
  "rank_pattern": null,
  "revision": null,
  "target_modules": [
    "value",
    "query"
  ],
  "target_r": 8,
  "task_type": "QUESTION_ANS",
  "tfinal": 15484,
  "tinit": 7742,
  "total_step": 77420,
  "trainable_token_indices": null,
  "use_dora": false,
  "use_qalora": false,
  "use_rslora": false
}